var button = document.getElementById("button");
button.addEventListener("click", function () {
    var num = Math.ceil(Math.random() * 100);
    var qianYan = chouQian(num);
    document.getElementById("qian").innerHTML=qianYan;
    document.getElementById("qian").style.textAlign ="left";
})
function chouQian(id) {
   
    qian='';
    if (id == 1){
        qian = `<br>
第一大吉<br>
七宝浮图塔<br>
高峯顶上安<br>
众人皆仰望<br>
莫作等闲看<br>
<br>
愿望：会充分地实现吧。<br>
疾病：会治愈吧。<br>
盼望的人：会出现吧。<br>
遗失物：变得迟迟地才找到吧。<br>
盖新居、搬家、嫁娶、旅行、交往等：全部很好吧。<br>
万事行为谨慎。粗心大意行事的话，就会发生意想之外的灾害吧。`;}
    else if (id == 2){
        qian = `<br>
第二小吉<br>
月被浮云翳<br>
立事自昏迷<br>
幸乞阴公佑<br>
何虑不开眉<br>
<br>
愿望：因为持续不断地努力，必定会实现。<br>
疾病：虽然拖长，但是之后可以康复吧。<br>
盼望的人：迟迟地才出现吧。<br>
遗失物：不能找出来吧。<br>
交往：要节制吧。<br>
盖新居、搬家：都不坏吧。<br>
结亲缘、旅行：顺利进行吧。`;}
    else if (id == 3){
        qian = `<br>
第三凶<br>
愁恼损忠良<br>
青宵一炷香<br>
虽然防小过<br>
闲虑觉时长<br>
<br>
愿望：难实现吧。<br>
疾病：虽然拖长，但是会治好吧。<br>
遗失物：难以找到吧。<br>
盼望的人：要花很久的时间吧。<br>
旅行：因为很坏，放弃吧。<br>
盖新居搬家：勉勉强强地算好吧。<br>
结婚交往：要节制吧。`;}
    else if (id == 4){
        qian = `<br>
第四吉<br>
累有兴云志<br>
君恩禄未封<br>
若逢侯手印<br>
好事始总总<br>
<br>
愿望：能实现吧。如果这样的话，终生幸福吧。<br>
疾病：变得迟迟地才会治好吧。<br>
遗失物：迟迟地才找到吧。<br>
盼望的人：会出现吧。<br>
旅行：途中要忍耐各式各样的困难吧。<br>
盖新居、搬家、结亲缘、交往：万事都好吧。`;}
    else if (id == 5){
        qian = `<br>
第五凶<br>
家道未能昌<br>
危危保祸殃<br>
暗云侵月桂<br>
佳人一炷香<br>
<br>
愿望：难以实现吧。<br>
疾病：难治好吧。<br>
遗失物：难找到吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：先放弃，暂时观察情况再说吧。<br>
结亲缘、旅行、交往：因为万事凶恶，请诸行为慎重行事。`;}
    else if (id == 6){
        qian = `<br>
第六末吉<br>
宅墓鬼凶多<br>
人事有爻讹<br>
伤财防损失<br>
祈福始中和<br>
<br>
愿望：难以实现吧。<br>
疾病：康复很花时间吧。<br>
遗失物：难找到吧。<br>
盼望的人：迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结亲缘、交往：坏吧。`;}
    else if (id == 7){
        qian = `<br>
第七凶<br>
登舟待便风<br>
月色暗蒙眬<br>
遇碾香轮去<br>
高山千万重<br>
<br>
愿望：难以实现吧。<br>
疾病：难以治愈吧。<br>
遗失物：难以找到吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：换时间吧。<br>
结亲缘、喜庆祝贺、旅行、交往：不好吧。`;}
    else if (id == 8){
        qian = `<br>
第八大吉<br>
勿头中见尾<br>
文华须得理<br>
禾刀自偶然<br>
当遇非常喜<br>
<br>
愿望：会实现吧。<br>
疾病：会治好。请注意养生吧。<br>
遗失物：可以找到吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家、交往：是好事吧。<br>
旅行：途中请不要粗心大意吧。<br>
结亲缘：全都是好的吧。`;}
    else if (id == 9){
        qian = `<br>
第九大吉<br>
有名须得遇<br>
三望一朝迁<br>
贵人来指处<br>
华菓应时鲜<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会找到吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
结亲缘、交往：全都好吧。<br>
旅行：没问题吧。`;}
    else if (id == 10){
        qian = `<br>
第十大吉<br>
旧用多成破<br>
新更始见财<br>
改求云外望<br>
枯木遇春开<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：立刻会找到吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：会变为好结果吧。<br>
结亲缘、旅行、交往：全部变为好结果吧。`;}
    else if (id == 11){
        qian = `<br>
第十一大吉<br>
有禄兴家业<br>
文华达帝都<br>
云中乘好箭<br>
兼得贵人扶<br>
<br>
愿望：会充分地实现吧。<br>
疾病：会治好吧。<br>
遗失物：会找到吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：没问题吧。<br>
结婚、交往：全部都能得到好结果吧。`;}
    else if (id == 12){
        qian = `<br>
第十二大吉<br>
杨柳遇春时<br>
残花发旧枝<br>
重重霜雪里<br>
黄金色更辉<br>
<br>
愿望：会实现吧。<br>
疾病：会变好吧。<br>
遗失物：会回来吧。<br>
盼望的人：晚出现吧。<br>
盖新居、搬家：会成为好结果吧。<br>
旅行：没有阻碍吧。<br>
结婚、交往：全都适当吧。`;}
    else if (id == 13){
        qian = `<br>
第十三大吉<br>
手把大阳辉<br>
东君发旧枝<br>
稼苗方欲秀<br>
犹更上云梯<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：立刻找就能找到吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：在春天和夏天好吧。<br>
结婚、交往：全部都好吧。`;}
    else if (id == 14){
        qian = `<br>
第十四末吉<br>
玉石未分时<br>
忧心转更悲<br>
前途通大道<br>
花发应残枝<br>
<br>
愿望：很花时间但会实现吧。<br>
疾病：会拖长吧，但是不会影响性命吧。<br>
遗失物：难出现吧。<br>
盼望的人：似乎会变得迟吧。<br>
盖新居、搬家：不太好吧。<br>
结婚：现在要节制，如果往后的话好吧。<br>
旅行、交往：避开吧。`;}
    else if (id == 15){
        qian = `<br>
第十五凶<br>
年乖数亦孤<br>
久病未能苏<br>
岸危舟未发<br>
龙卧失明珠<br>
<br>
愿望：难以实现吧。<br>
疾病：危险吧。<br>
遗失物：难找回吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：都不好吧。<br>
旅行、结亲缘：坏吧。`;}
    else if (id == 16){
        qian = `<br>
第十六吉<br>
破改重成望<br>
前途喜亦宁<br>
贵人相助处<br>
禄马照前程<br>
<br>
愿望：能被实现吧。<br>
疾病：会康复吧。<br>
遗失物：会出现吧。<br>
盼望的人：会来吧。<br>
盖新居、搬家：会有好结果吧。<br>
旅行：好吧。结亲缘、交往：全部会变成好结果吧。`;}
    else if (id == 17){
        qian = `<br>
第十七凶<br>
怪异防忧恼<br>
人宅见分离<br>
惜华还值雨<br>
杯酒惹闲非<br>
<br>
愿望：难实现吧。<br>
疾病：康复需要长时间吧。<br>
遗失物：不会出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：先放弃，暂时观察情况再说吧。<br>
旅行：似乎引起坏的结果吧。<br>
婚事、交往：全部不好吧。`;}
    else if (id == 18){
        qian = `<br>
第十八吉<br>
离暗出明时<br>
麻衣变绿衣<br>
旧忧终是退<br>
遇禄应交辉<br>
<br>
愿望：会实践吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结亲缘、交往：全部变为好结果吧。`;}
    else if (id == 19){
        qian = `<br>
第十九末小吉<br>
家道生荆棘<br>
儿孙防虎威<br>
香前祈福厚<br>
方得免分离<br>
<br>
愿望：能实现一半吧。<br>
疾病：虽然长期得病，但是不会危及性命吧。<br>
遗失物：大概找回不来了吧。<br>
盼望的人：变成迟迟地出现吧。<br>
盖新居、搬家：不好也不坏吧。<br>
旅行：节制比较好吧。<br>
结婚：不会到达好的结果吧。<br>
交往：节制吧。`;}
    else if (id == 20){
        qian = `<br>
第二十吉<br>
月出渐分明<br>
家财每每兴<br>
何言先有滞<br>
更变立功名<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会来吧。<br>
盖新居、搬家：好吧。<br>
结婚、交往：全部都得到好结果吧。<br>
旅行：好吧。`;}
    else if (id == 21){
        qian = `<br>
第二十一吉<br>
洗出经年否<br>
光华得再清<br>
所求终吉利<br>
重日照前程<br>
<br>
愿望：能被实现吧。<br>
疾病：虽然会恢复但是切忌粗心大意。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
结婚：会得到好结果吧。<br>
旅行、交往：全部好吧。`;}
    else if (id == 22){
        qian = `<br>
第二十二吉<br>
渐渐浓云散<br>
看看月再明<br>
逢春华菓秀<br>
雨过竹重青<br>
<br>
愿望：虽然能被实现，但是变得比较晚吧。<br>
疾病：因为会治好，耐心等待康复吧。<br>
遗失物：虽然会出现但很迟吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
结婚、旅行、交往：全都好吧。`;}
    else if (id == 23){
        qian = `<br>
第二十三吉<br>
红云随步起<br>
一箭中青霄<br>
鹿行千里远<br>
争知去路遥<br>
【争知】就是现代用语的『怎知』之意。<br>
<br>
愿望：虽然会实现，但是要考虑能力吧。<br>
疾病：难以康复吧。<br>
遗失物：难以找到吧。<br>
盼望的人：不能出现吧。<br>
盖新居、搬家：好吧。<br>
结婚、交往：好吧。<br>
旅行：没问题吧。`;}
    else if (id == 24){
        qian = `<br>
第二十四凶<br>
三女莫相逢<br>
盟言说未通<br>
门里心肝挂<br>
缟素子重重<br>
（三女的意思是奸字）<br>
<br>
愿望：不会实现吧。<br>
疾病：虽然拖很长，但会治好吧。<br>
遗失物：变成到后来才找到吧。<br>
盼望的人：不能出现吧。<br>
盖新居、搬家：不好吧。<br>
旅行：不好吧。<br>
结婚、交往：变成不好的结果吧。`;}
    else if (id == 25){
        qian = `<br>
第二十五吉<br>
枯木逢春生<br>
前途必利亨<br>
亦得佳人箭<br>
乘车禄自行<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：迟迟才来吧。<br>
盖新居、搬家：似乎没问题。<br>
结婚、旅行、交往：全部都变成好结果吧。`;}
    else if (id == 26){
        qian = `<br>
第二十六吉<br>
将军有异声<br>
进兵万里程<br>
争知临敌处<br>
道胜却虚名<br>
【争知】就是现代用语的『怎知』之意。<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：会变成好结果吧。`;}
    else if (id == 27){
        qian = `<br>
第二十七吉<br>
望禄应重山<br>
花红喜悦颜<br>
举头看皎月<br>
渐出黑云间<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧，但切忌粗心大意。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：非常好吧。<br>
结婚、交往：全部都变成好结果吧。`;}
    else if (id == 28){
        qian = `<br>
第二十八凶<br>
意速无船渡<br>
波深必误身<br>
切须回旧路<br>
方可免灾迍<br>
迍：zhun(1,处境艰险，前进困难<br>
<br>
愿望：难以实现吧。<br>
疾病：如果长期养生的话会治好吧。<br>
遗失物：难出现吧。<br>
盼望的人：变得迟迟地才出现吧。<br>
盖新居、搬家：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 29){
        qian = `<br>
第二十九吉<br>
忧轗渐消融<br>
求名得再通<br>
宝财临禄位<br>
当遇主人公<br>
轗：kan(3，形容车行颠簸不顺的样子，比喻人不得志。<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 30){
        qian = `<br>
第三十半吉<br>
仙鹤立高枝<br>
防他暗箭亏<br>
井畔刚刀利<br>
户内更防危<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：如果能祈求神佛的保佑，会变成勉强可以的结果吧。<br>
旅行：坏吧。<br>
结婚、交往：节制吧。`;}
    else if (id == 31){
        qian = `<br>
第三十一末吉<br>
鲲鲸未变时<br>
且守碧潭溪<br>
风云兴巨浪<br>
一息过天涯<br>
<br>
愿望：虽能被实现，但要考虑时机吧。<br>
疾病：拖很久吧。<br>
遗失物：变得迟迟地才出现吧。<br>
盼望的人：变得迟迟地才出现吧。<br>
盖新居、搬家：没阻碍吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 32){
        qian = `<br>
第三十二吉<br>
似玉藏深石<br>
休将故眼看<br>
一朝良匠别<br>
方见宝光寒<br>
<br>
愿望：会实现吧。<br>
疾病：虽然会拖长，但是不会失去生命。<br>
遗失物：会出现吧。<br>
盼望的人：变得迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
结婚、交往：全部和好结果有关吧。`;}
    else if (id == 33){
        qian = `<br>
第三十三吉<br>
枯木逢春艳<br>
芳菲再发林<br>
云间方见月<br>
前遇贵人钦<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：没有阻碍吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 34){
        qian = `<br>
第三十四吉<br>
腊木春将至<br>
芳菲喜再新<br>
鲲鲸兴巨浪<br>
举钩禄为真<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：迟迟才出现吧。<br>
盼望的人：迟吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都和好结果相连吧。`;}
    else if (id == 35){
        qian = `<br>
第三十五吉<br>
射鹿须乘箭<br>
故僧引路归<br>
遇道同仙籍<br>
光华映晚晖<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：变迟才出现吧。<br>
盖新居、搬家：没有障碍吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 36){
        qian = `<br>
第三十六末吉<br>
先损后有益<br>
如月之剥蚀<br>
玉兔待重生<br>
光华当满室<br>
<br>
愿望：稍后会实现吧。<br>
疾病：虽然拖长，但可以治愈吧。<br>
遗失物：难出现吧。<br>
盼望的人：迟迟地才出现吧。<br>
盖新居、搬家：应该先放弃，暂时多观察情况再说吧。<br>
旅行：途中，似乎会有不好的事吧。<br>
结亲缘、喜庆、交往：不好吧。`;}
    else if (id == 37){
        qian = `<br>
第三十七半吉<br>
阴叆未能通<br>
求名亦未逢<br>
幸然须有变<br>
一箭中双鸿<br>
<br>
愿望：难以实现吧。<br>
疾病：变成迟迟地才好转吧。<br>
遗失物：变成迟迟地才出现吧。<br>
盼望的人：变成迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：往后一点，变成好吧。`;}
    else if (id == 38){
        qian = `<br>
第三十八半吉<br>
月照天书静<br>
云生雾彩霞<br>
久想离庭客<br>
无事惹咨嗟<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：不好也不坏吧。<br>
旅行：先放弃，暂时观察情况再说吧。<br>
结婚、交往：先放弃，暂时观察情况吧。`;}
    else if (id == 39){
        qian = `<br>
第三十九凶<br>
望用方心腹<br>
家乡被火灾<br>
忧危三五度<br>
由损断头财<br>
<br>
愿望：难以实现吧。<br>
疾病：又坏又危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：避开比较好吧。<br>
旅行：不好吧。<br>
结婚、交往：招致坏结果吧。`;}
    else if (id == 40){
        qian = `<br>
第四十末小吉<br>
中正方成道<br>
奸邪恐惹愆　<br>
壶中盛妙药<br>
非久去烦煎<br>
愆：qian(1，过失、罪过之意<br>
<br>
愿望：难以立刻地实现吧。<br>
疾病：虽然拖长但会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：变成迟迟才地出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：不好也不坏吧。`;}
    else if (id == 41){
        qian = `<br>
第四十一末吉<br>
有物不周旋<br>
须防损半边<br>
家乡烟火里<br>
祈福始安然<br>
<br>
愿望：难以实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：变成迟迟地才出现吧。<br>
盖新居、搬家：不好吧。<br>
旅行：途中似乎有不好的事。<br>
结婚、交往：会产生不好的结果吧。`;}
    else if (id == 42){
        qian = `<br>
第四十二吉<br>
桂华春将到<br>
云天好进程<br>
贵人相遇处<br>
暗月再分明<br>
<br>
愿望：会实现吧。<br>
疾病：会治愈吧。<br>
遗失物：会出现吧。<br>
盖新居、搬家：好吧。<br>
盼望的人：变成迟迟地才出现吧。<br>
旅行：好吧。<br>
结婚、交往：全都会变成好结果吧。`;}
    else if (id == 43){
        qian = `<br>
第四十三吉<br>
月桂将相满<br>
追鹿映山溪<br>
贵人乘远箭<br>
好事始相宜<br>
<br>
愿望：会实现吧。<br>
疾病：虽然拖长但是会治好吧。<br>
遗失物：难出现吧。<br>
盼望的人：变成迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：变成好结果吧。`;}
    else if (id == 44){
        qian = `<br>
第四十四吉<br>
盘中黑白子<br>
一着要先机<br>
天龙降甘泽<br>
洗出旧根基<br>
<br>
愿望：会实现吧。<br>
疾病：会治愈吧。<br>
遗失物：会出现吧。<br>
盼望的人：变成迟迟地才出现吧。<br>
盖新居、搬家：没问题吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 45){
        qian = `<br>
第四十五吉<br>
有意兴高显<br>
禄马引前程<br>
得遇云中箭<br>
芝兰满路生<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：迟迟地才出现吧。<br>
盼望的人：变迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好结果相连吧。`;}
    else if (id == 46){
        qian = `<br>
第四十六凶<br>
雷发震天昏<br>
佳人独掩门<br>
交加文书上<br>
无事也遭迍<br>
迍：zhun(1处境艰险，前进困难<br>
<br>
愿望：难以实现吧。<br>
疾病：会治好吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：现在放弃吧。<br>
旅行：在途中有不好的事吧。<br>
结婚、交往：会产生不好的结果吧。`;}
    else if (id == 47){
        qian = `<br>
第四十七吉<br>
更望身前立<br>
何期在晚成<br>
若遇重山去<br>
财禄自相迎<br>
<br>
愿望：会实现吧。<br>
疾病：变成往后才会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：变得迟迟才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：在将来似乎有好事吧。<br>
结婚、交往：全部都可得到好结果吧。`;}
    else if (id == 48){
        qian = `<br>
第四十八小吉<br>
见禄隔前溪<br>
劳心休更迷<br>
一朝逢好渡<br>
鸾凤入云飞<br>
<br>
愿望：如果一直抱持着正直的心的话，到后来能被实现吧。<br>
疾病：虽然拖长，但将来会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：变成迟迟才来吧。<br>
盖新居、搬家：虽然开始不好，但是到后来会变好吧。<br>
结婚、交往、旅行：马马虎虎吧。`;}
    else if (id == 49){
        qian = `<br>
第四十九吉<br>
正好中秋月<br>
蟾蜍皎洁间<br>
暗云知何处<br>
故故两相攀<br>
<br>
愿望：会实现吧。<br>
疾病：严重吧。<br>
遗失物：难出现吧。<br>
盼望的人：变成迟迟才出现吧。<br>
盖新居、搬家：马马虎虎吧。<br>
旅行：好吧。<br>
结婚、交往：马马虎虎吧。`;}
    else if (id == 50){
        qian = `<br>
第五十吉<br>
有达宜更变<br>
重山利政逢<br>
前途相偶合<br>
财禄保亨通<br>
（重山即指两山相迭的出字）<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：变迟吧。<br>
盖新居、搬家：好吧。<br>
旅行：成为好的旅行吧。<br>
结婚、交往：成为好的结果吧。`;}
    else if (id == 51){
        qian = `<br>
第五十一吉<br>
修进甚功辛<br>
劳生未得时<br>
腾身游碧汉<br>
方得遇高枝<br>
<br>
愿望：会实现吧。<br>
疾病：变成往后才治好吧。<br>
遗失物：难出现吧。<br>
盼望的人：变晚吧。<br>
盖新居、搬家：好吧。<br>
旅行：好事吧。<br>
结婚、交往：会得到好结果吧。`;}
    else if (id == 52){
        qian = `<br>
第五十二凶<br>
有僭须惹讼<br>
兼有事交加<br>
门里防人危<br>
灾临莫叹嗟<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：马马虎虎还算有点好吧。<br>
旅行：因为不好，避开吧。<br>
结婚、交往：不好也不坏吧。`;}
    else if (id == 53){
        qian = `<br>
第五十三吉<br>
久困渐能安<br>
云书降印权<br>
残花终结实<br>
时亨禄自迁<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：变得迟迟才找到吧。<br>
盼望的人：迟迟地才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：变成好的旅行吧。<br>
结婚、交往：全都朝向好的方向发展吧。`;}
    else if (id == 54){
        qian = `<br>
第五十四凶<br>
身同意不同<br>
月蚀暗长空<br>
轮虽常在手<br>
鱼水未相逢<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：暂时放弃，再观察看看吧。<br>
结婚、交往：变成坏结果吧。`;}
    else if (id == 55){
        qian = `<br>
第五十五吉<br>
云散月重明<br>
天书得志诚<br>
虽然多阻滞<br>
花发再重荣<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会找到吧。<br>
盼望的人：变迟吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 56){
        qian = `<br>
第五十六末小吉<br>
生涯喜又忧<br>
未老先白头<br>
劳心千百度<br>
方遇贵人留<br>
<br>
愿望：难实现吧。<br>
疾病：变成迟迟才治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：迟迟才出现吧。<br>
盖新居、搬家：半吉吧。<br>
旅行：如果有一起同行的人的话好（安全）吧。<br>
结婚、交往：马马虎虎还可以吧。`;}
    else if (id == 57){
        qian = `<br>
第五十七吉<br>
欲渡长江阔<br>
波深未自俦<br>
前津逢浪静<br>
重整钩鳌钩<br>
<br>
愿望：会实现吧。<br>
疾病：虽然会治好，但会拖长吧。<br>
遗失物：会出现吧。<br>
盼望的人：变迟迟才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：坏吧。<br>
结婚、交往：马马虎虎还可以吧。`;}
    else if (id == 58){
        qian = `<br>
第五十八凶<br>
有径江海隔<br>
车行峻岭危<br>
亦防多进退<br>
犹恐小人亏<br>
<br>
愿望：难实现吧。<br>
疾病：不能安心吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：中止吧。<br>
结婚、交往、旅行：坏吧。`;}
    else if (id == 59){
        qian = `<br>
第五十九凶<br>
去住心无定<br>
行藏亦未宁<br>
一轮清皎洁<br>
却被黑云乘<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：似乎会发生坏事吧。<br>
结婚、交往：得到坏结果吧。`;}
    else if (id == 60){
        qian = `<br>
第六十小吉<br>
高危安可涉<br>
平坦是延年<br>
守道当逢泰<br>
风云不偶然<br>
<br>
愿望：如果正心而行的话会实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：不好吧。<br>
旅行：马马虎虎地算好吧。<br>
结婚、交往：马马虎虎地算好吧。`;}
    else if (id == 61){
        qian = `<br>
第六十一半吉<br>
旧愆何日解<br>
户内保婵娟<br>
要逢十一口<br>
遇鼠过牛边<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难找到吧。<br>
盼望的人：变迟吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：不好吧。`;}
    else if (id == 62){
        qian = `<br>
第六十二大吉<br>
灾轗时时退<br>
名显四方扬<br>
改故重乘禄<br>
昴高福自昌<br>
轗：kan(3，形容车行颠簸不顺的样子，比喻人不得志。<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：没问题吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 63){
        qian = `<br>
第六十三凶<br>
何故生荆棘<br>
佳人意渐疏<br>
久困重轮下<br>
黄金未出渠<br>
<br>
愿望：难实现吧。<br>
疾病：难治愈吧。<br>
遗失物：难找到吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：似乎会发生坏事吧。<br>
结婚、交往：会产生坏结果吧。`;}
    else if (id == 64){
        qian = `<br>
第六十四凶<br>
安居且虑危<br>
情深主别离<br>
风飘波浪急<br>
鸳鸯各自飞<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：不会出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：还可以吧。<br>
旅行：还可以吧。<br>
结婚、交往：不好吧。`;}
    else if (id == 65){
        qian = `<br>
第六十五末吉<br>
苦病兼防辱<br>
乘危亦未稣<br>
若见一阳后<br>
方可作良图<br>
<br>
愿望：以后会实现吧。<br>
疾病：虽然拖长但会治好吧。<br>
遗失物：不会出现吧。<br>
盼望的人：变得迟迟才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：安全吧。<br>
结婚、交往：得到还可以的好结果吧。`;}
    else if (id == 66){
        qian = `<br>
第六十六凶<br>
水滞少波涛<br>
飞鸿落羽毛<br>
重忧心绪乱<br>
闲事惹风骚<br>
<br>
愿望：难实现。<br>
疾病：可疑，不明朗吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 67){
        qian = `<br>
第六十七凶<br>
枯木未生枝<br>
独步上云岐<br>
岂知身未稳<br>
独自惹闲非<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：多比较看看比较好吧。<br>
旅行：不好吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 68){
        qian = `<br>
第六十八吉<br>
异梦生英杰<br>
前来事可疑<br>
芳菲春日暖<br>
依旧发残枝<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出来吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 69){
        qian = `<br>
第六十九凶<br>
明月暗云浮<br>
花红一半枯<br>
惹事伤心处<br>
行舟莫远图<br>
<br>
愿望：难实现吧。<br>
疾病：切忌粗心大意。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：放弃吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 70){
        qian = `<br>
第七十凶<br>
雷发庭前草<br>
炎火向天飞<br>
一心来赶禄<br>
争奈掩朱扉<br>
【争奈】就是宋代以后的『怎奈』、『无奈』之意（更早的唐代则是『争那』）。<br>
<br>
愿望：难实现吧。<br>
疾病：不能安心吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：避免吧。<br>
结婚、旅行、交往：万事坏吧。`;}
    else if (id == 71){
        qian = `<br>
第七十一凶<br>
道业未成时<br>
何期两不宜<br>
事烦心绪乱<br>
飜做徘徊思<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
结婚、旅行、交往：产生坏的结果吧。`;}
    else if (id == 72){
        qian = `<br>
第七十二吉<br>
户内防重厄<br>
花菓见分枝<br>
严霜纔过后<br>
方可始相宜<br>
<br>
愿望：后来会实现吧。<br>
疾病：会拖长吧。<br>
遗失物：变成迟迟才能找到吧。<br>
盼望的人：迟迟才出现吧。<br>
盖新居、搬家：还算好吧。<br>
旅行：没有特别的阻碍吧。<br>
结婚、交往：虽然还算好，但最后变得更好吧。`;}
    else if (id == 73){
        qian = `<br>
第七十三吉<br>
久暗渐分明<br>
登江绿水澄<br>
芝书从远降<br>
终得异人成<br>
<br>
愿望：变得往后才能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出来吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 74){
        qian = `<br>
第七十四凶<br>
蛇虎正交罗<br>
牛生二尾多<br>
交岁方成庆<br>
上下不能和<br>
<br>
愿望：难以实现吧。<br>
疾病：不能安心吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
结婚、旅行、交往：坏吧。`;}
    else if (id == 75){
        qian = `<br>
第七十五凶<br>
孤舟欲过岸<br>
浪急渡人空<br>
女人立流水<br>
望月意情浓<br>
<br>
愿望：难实现吧。<br>
疾病：陷入的话（若是病人的话）危险吧。<br>
遗失物：不能找回来吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 76){
        qian = `<br>
第七十六吉<br>
富贵天之佑<br>
何须苦用心<br>
前程应显迹<br>
久用得高临<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出来吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全部都好吧。`;}
    else if (id == 77){
        qian = `<br>
第七十七凶<br>
累滞未能稣<br>
求名莫远图<br>
登舟波浪急<br>
咫尺隔天衢<br>
<br>
愿望：难实现吧。<br>
疾病：不能安心吧。<br>
遗失物：难找到吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 78){
        qian = `<br>
第七十八大吉<br>
但存公道正<br>
何愁理去忠<br>
松柏苍苍翠<br>
前山禄马重<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出来吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧<br>
    `;}
    else if (id == 79){
        qian = `<br>
第七十九吉<br>
残月未还光<br>
樽前非语伤<br>
户中有人厄<br>
祈福保青阳<br>
<br>
愿望：虽然能被实现但是大愿望不行吧。<br>
疾病：虽然会拖长，但会治好吧。<br>
遗失物：迟迟地才找到吧。<br>
盼望的人：变迟才出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 80){
        qian = `<br>
第八十大吉<br>
深山多养道<br>
忠正帝王宣<br>
凤遂鸾飞去<br>
升高过九天<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：是好的，因为全部都保持谦虚的姿态，所以会招来好结果吧。`;}
    else if (id == 81){
        qian = `<br>
第八十一小吉<br>
道合须成合<br>
先忧事更多<br>
所求财宝盛<br>
更变得中和<br>
<br>
愿望：如果保持端正的心的话，会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 82){
        qian = `<br>
第八十二凶<br>
火发应连天<br>
新愁惹旧愆<br>
欲求千里外<br>
要渡更无船<br>
<br>
愿望：难实现吧。<br>
疾病：可疑，不明朗吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：多比较看看比较好吧。<br>
结婚、交往：全都坏吧。`;}
    else if (id == 83){
        qian = `<br>
第八十三凶<br>
举步出云端<br>
高枝未可攀<br>
升头看皎月<br>
犹在黑云间<br>
<br>
愿望：难实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：危险吧。<br>
结婚、交往：产生坏结果吧。`;}
    else if (id == 84){
        qian = `<br>
第八十四凶<br>
否极方无泰<br>
花开值晚秋<br>
人情不调备<br>
财宝鬼来偷<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：不好吧。<br>
结婚、交往：全部都产生坏的结果吧。`;}
    else if (id == 85){
        qian = `<br>
第八十五大吉<br>
望用何愁晚<br>
求名渐得宁<br>
云梯终有望<br>
归路入蓬瀛<br>
<br>
愿望：变成往后才会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 86){
        qian = `<br>
第八十六大吉<br>
花发应阳台<br>
车行进宝财<br>
执文朝帝殿<br>
走马听声雷<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全都好吧。`;}
    else if (id == 87){
        qian = `<br>
第八十七大吉<br>
凿石方逢玉<br>
淘沙始见金<br>
青霄终有路<br>
只恐不坚心<br>
<br>
愿望：能被实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 88){
        qian = `<br>
第八十八凶<br>
作事不和同<br>
临危更主凶<br>
佳人生苦根<br>
闲虑两三重<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：不会出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 89){
        qian = `<br>
第八十九大吉<br>
一片无瑕玉<br>
从今好琢磨<br>
得遇高人识<br>
方逢喜气多<br>
<br>
愿望：能被实现吧。疾病：会治好吧。<br>
遗失物：不会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 90){
        qian = `<br>
第九十大吉<br>
一信向天飞<br>
秦川舟自归<br>
前途成好事<br>
应得贵人推<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全部都好吧。`;}
    else if (id == 91){
        qian = `<br>
第九十一吉<br>
改变前途去<br>
月桂又逢圆<br>
云中乘禄至<br>
凡事可宜先<br>
<br>
愿望：如果守正道的话会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 92){
        qian = `<br>
第九十二吉<br>
自幼常为旅<br>
逢春骏马骄<br>
前程宜进步<br>
得箭降青霄<br>
<br>
愿望：会实现吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 93){
        qian = `<br>
第九十三吉<br>
有鱼临旱池<br>
跳跃入波涛<br>
隔中须有望<br>
先且虑尘劳<br>
<br>
愿望：变成到后来能实现吧。<br>
疾病：会拖长吧。<br>
遗失物：难出现吧。<br>
盼望的人：变迟吧。<br>
盖新居、搬家：马马虎虎还算可以吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 94){
        qian = `<br>
第九十四半吉<br>
事忌樽前语<br>
人防小辈交<br>
幸乞阴公佑<br>
方免事敌爻<br>
<br>
愿望：不能按照所想的实现吧。<br>
疾病：虽然会拖长但是不会危害生命吧。要特别用心维持健康吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：不好吧。<br>
旅行：马马虎虎还算可以吧。<br>
结婚、交往：勉强还算可以吧。`;}
    else if (id == 95){
        qian = `<br>
第九十五吉<br>
志气勤修业<br>
禄位未造逢<br>
若闻金鸡语<br>
乘船得便风<br>
<br>
愿望：能被实现吧。<br>
疾病：变成迟迟才治好吧。<br>
遗失物：变成迟迟地才出现吧。<br>
盼望的人：迟迟地才出现吧。<br>
盖新居、搬家：没有阻碍吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 96){
        qian = `<br>
第九十六大吉<br>
鸡逐凤同飞<br>
高林整羽仪<br>
棹舟须济岸<br>
宝货满船归<br>
<br>
愿望：能被实现吧。但是，抱持全面谨慎的心是很重要的。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：全部好吧。`;}
    else if (id == 97){
        qian = `<br>
第九十七凶<br>
雾罩重楼屋<br>
佳人水上行<br>
白云归去路<br>
不见月波澄<br>
<br>
愿望：难以实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：不好吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 98){
        qian = `<br>
第九十八凶<br>
欲理新丝乱<br>
闲愁足是非<br>
只困罗网里<br>
相见几人悲<br>
<br>
愿望：难以实现吧。<br>
疾病：可疑，不明朗吧。<br>
遗失物：难出现吧。<br>
盼望的人：不会出现吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：坏吧。`;}
    else if (id == 99){
        qian = `<br>
第九十九大吉<br>
红日当门照<br>
暗月再重圆<br>
遇珍须得宝<br>
颇有称心田<br>
<br>
愿望：能被实现吧。在万事中要用谦虚的心吧。<br>
疾病：会治好吧。<br>
遗失物：会出现吧。<br>
盼望的人：会出现吧。<br>
盖新居、搬家：好吧。<br>
旅行：好吧。<br>
结婚、交往：好吧。`;}
    else if (id == 100){
        qian = `<br>
第一百签凶<br>
禄走白云间<br>
携琴走远山<br>
不遇神仙面<br>
空惹意阑珊<br>
<br>
愿望：难实现吧。<br>
疾病：危险吧。<br>
遗失物：难出现吧。<br>
盼望的人：坏吧。<br>
盖新居、搬家：坏吧。<br>
旅行：坏吧。<br>
结婚、交往：全部坏吧。`;}
    return qian;
}